languages/elixir/reference/concept-map.mermaid
graph TD;
    Start --> variables

    subgraph concepts
      encoding-->codepoint
      encoding-->UTF-8
      UTF-8-->codepoint

      lazy-evaluation

      actor-model-concurrency
    end

    subgraph code-syntax
      module
      named-function-->module
      module-->naming-conventions

      named-function
      named-function-->function-capture
      named-function-->naming-conventions
      named-function-->def-arguments

      variables
      variables-->assignment
      variables-->pattern-matching
      variables-->naming-conventions

      operators
      variables-->operators
      operators-->control-flow

      control-flow
      pattern-matching-->case
      control-flow-->case
      control-flow-->cond
      control-flow-->if-unless-else
      control-flow-->with

      naming-conventions
    end

    subgraph types
      type
      variables-->type

      type-->atom
      type-->boolean
      atom-->boolean
      boolean-->operators
      type-->number
      type-->binary
      type-->list
      type-->tuple
      type-->function
      operators-->function
      function-->named-function
      type-->pid
      actor-model-concurrency-->pid
    end

    subgraph complex-types
      keyword-list
      list-->keyword-list
      tuple-->keyword-list
      atom-->keyword-list

      map
      type-->map

      struct
      map-->struct

      date
      struct-->date

      time
      struct-->time

      native_time
      struct-->native_time

      range
      lazy-evaluation-->range
      list-->range

      stream
      lazy-evaluation-->stream
      list-->stream

      ports

      reference
    end

    subgraph numbers
      number-->integer
      integer-->integer-binary-form
      integer-->integer-octal-form
      integer-->integer-hexadecimal-form
      integer-->codepoint

      number-->float
      float-->scientific-notation-form
    end

    subgraph lists
      list-->head-tail-notation
      list-->comprehension
      list-->iodata

      list-->charlist
      codepoint-->charlist
    end

    subgraph binaries
      binary-->binary-special-forms

      subgraph strings
        binary-->string

        string-->string-interpolation
        string-->heredocs
      end
    end

    subgraph maps
      map-->update-syntax
    end

    subgraph regular-expressions
      Regex
      string-->Regex
    end

    subgraph protocols
      protocol
      module-->protocol
      struct-->protocol
    end

    subgraph behaviours
      behaviour
      module-->behaviour
    end

    subgraph typespecs
      typespec
      named-function-->typespec
    end

    subgraph metaprogramming
      AST[Abstract Syntax Tree]
      Macro
    end

    subgraph concurrency
      spawn-->send-receive
      pid-->spawn

      send-receive
      pid-->send-receive

      GenServer
      pid-->GenServer

      Agent
      pid-->Agent

      Task
      pid-->Task
    end

    subgraph sigils
      sigil_r["#126;r{...}"]
      Regex-->sigil_r

      sigil_s["#126;s{...}"]
      string-->sigil_s

      sigil_c["#126;c{...}"]
      charlist-->sigil_c

      sigil_w["#126;w{...}"]
      list-->sigil_w
      string-->sigil_w

      sigil_wa["#126;w{...}a"]
      list-->sigil_wa
      atom-->sigil_wa

      sigil_wc["#126;w{...}c"]
      list-->sigil_wc
      charlist-->sigil_wc

      sigil_D["#126;D{...}"]
      date-->sigil_D

      sigil_T["#126;T{...}"]
      time-->sigil_T

      sigil_N["#126;N{...}"]
      native_time-->sigil_N
    end
